# Core dotfile tooling
stow
mise
git
libsecret
gnupg
openssh
pinentry
flatpak
dconf
gnome-keyring
fish
starship
foot
ghostty
hyprland
uwsm
greetd
greetd-tuigreet
hyprlock
hypridle
rofi
waybar
swaync
waypaper
swww
swayosd
ksnip
blueman
adwaita-cursors
adw-gtk-theme
papirus-icon-theme
neovim
code
cava
firefox

# Shell and CLI
eza
zoxide
direnv
fzf
ripgrep
fd
jq
yq
bat
bat-extras
btop
lazygit
fastfetch
yazi
tmux
tree
ncdu
unzip
zip
rsync
github-cli
git-delta
onefetch
htop
xdg-utils
dconf-editor
man-pages
openssl
psmisc
pre-commit
httpie
tealdeer
glow
hyperfine
tokei
dust
duf
procs
bottom
sd
choose
doggo
valgrind
vivid
shellcheck
shfmt
uv
micro
viu
opencode
claude-code

# Build and language tooling
make
cmake
meson
ninja
gdb
jdk-openjdk
maven
gradle
postgresql
ansible
android-tools
scrcpy
cilium-cli

# Wayland / Hyprland helpers
wl-clipboard
wl-clip-persist
cliphist
grim
slurp
wf-recorder
gifsicle
pavucontrol
network-manager-applet
gvfs
gvfs-smb
cifs-utils
samba
playerctl
brightnessctl
hyprpicker
pamixer
libnotify
nautilus
zenity

# Desktop apps carried over from NixOS config
discord
thunderbird
vlc
imv
mpv
ffmpeg
openh264
gstreamer
gst-plugins-base
gst-plugins-good
gst-plugins-bad
gst-plugins-ugly
gst-libav
gimp
blender
audacity
obs-studio
mission-center
filezilla
obsidian
audacious
viewnior
evince
file-roller
gnome-text-editor
sushi
webp-pixbuf-loader
poppler
ffmpegthumbnailer
libheif
zathura
zathura-pdf-mupdf
gnome-calculator
gnome-disk-utility
easyeffects
lsp-plugins
flatseal
bleachbit
wine
winetricks
steam

# Virtualization and containers
virt-manager
virt-viewer
qemu-full
libvirt
spice-gtk
docker

# Dev utilities that are not version-managed by mise
docker-compose
just
k9s
kubectx
protobuf
grpc

# Fonts / themes
ttf-fira-code
ttf-firacode-nerd
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
noto-fonts-emoji
ttf-fantasque-nerd
