golang.go
jnoortheen.nix-ide
ms-python.python
ms-vscode.cpptools
redhat.vscode-yaml
redhat.ansible
redhat.java
esbenp.prettier-vscode
timonwong.shellcheck
foxundermoon.shell-format
hashicorp.terraform
hashicorp.hcl
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
dbaeumer.vscode-eslint
ocamllabs.ocaml-platform
github.copilot
github.copilot-chat
github.vscode-pull-request-github
yzhang.markdown-all-in-one
bierner.markdown-mermaid
eamodio.gitlens
streetsidesoftware.code-spell-checker
jgclark.vscode-todo-highlight
pkief.material-icon-theme
sainnhe.everforest
anthropic.claude-code
kilocode.kilo-code
ms-vscode.makefile-tools
MermaidChart.vscode-mermaid-chart
ziglang.vscode-zig
